In [1]:
import pandas as pd 
from sqlalchemy import create_engine

engine = create_engine('sqlite:///../data/colombia_departments.db')

In [2]:
def run_query(query):
    with engine.connect() as connection:
        result = pd.read_sql_query(query, connection)
    return result

### Average extension

In [3]:
query1 = """
    SELECT AVG(extension_km2) AS average_extension
    FROM departments;
    """
consult1 = run_query(query1)
consult1

   average_extension
0        35659.71875

### Average habitants

In [4]:
query2 = """
    SELECT AVG(population) AS AVG_population
    FROM departments;
    """
consult2 = run_query(query2)
consult2

   AVG_population
0    1.306340e+06

### Largest number of habitants

In [5]:

query3 = """
    SELECT name, population
    FROM departments
    ORDER BY population DESC
    LIMIT 1;
    """

consult3 = run_query(query3)
consult3

        name  population
0  Antioquia     6520917

### Less number of habitants

In [6]:
query4 = """
    SELECT name, population
    FROM departments
    ORDER BY population ASC
    LIMIT 1; 
"""
consult4 = run_query(query4)
consult4

     name  population
0  Vaupés       46001

### Departments for region

In [8]:
query5 = """
    SELECT r.name AS region, COUNT(d.id) AS num_departments
    FROM region r
    JOIN departments d ON r.id = d.region_id
    GROUP BY r.name;
"""
consult5 = run_query(query5)
consult5

      region  num_departments
0   Amazonía                6
1     Andina               10
2     Caribe                8
3  Orinoquía                4
4   Pacífico                4